In [1]:
import pandas as pd

In [2]:
prices = pd.Series([1,1,2,3,5], index = ['apple', 'pear', 'banana', 'mango', 'jackfruit'])

In [3]:
inventory = pd.Series([10,50,41,22], index = ['pear', 'banana', 'mango', 'apple'])

In [4]:
discount_prices = prices.apply(lambda x: .9 * x if x > 3 else x)

In [5]:
produce = pd.DataFrame({'price': prices, 'discount_price': discount_prices, 'inventory': inventory})

In [6]:
produce

           price  discount_price  inventory
apple          1             1.0       22.0
banana         2             2.0       50.0
jackfruit      5             4.5        NaN
mango          3             3.0       41.0
pear           1             1.0       10.0

In [8]:
produce.describe

<bound method NDFrame.describe of            price  discount_price  inventory
apple          1             1.0       22.0
banana         2             2.0       50.0
jackfruit      5             4.5        NaN
mango          3             3.0       41.0
pear           1             1.0       10.0>

In [9]:
produce.describe()

         price  discount_price  inventory
count  5.00000         5.00000   4.000000
mean   2.40000         2.30000  30.750000
std    1.67332         1.48324  18.099263
min    1.00000         1.00000  10.000000
25%    1.00000         1.00000  19.000000
50%    2.00000         2.00000  31.500000
75%    3.00000         3.00000  43.250000
max    5.00000         4.50000  50.000000

In [11]:
produce.loc['pear':, 'price']

pear    1
Name: price, dtype: int64

In [12]:
produce.iloc[2:, 1]

jackfruit    4.5
mango        3.0
pear         1.0
Name: discount_price, dtype: float64

In [13]:
produce.values

array([[ 1. ,  1. , 22. ],
       [ 2. ,  2. , 50. ],
       [ 5. ,  4.5,  nan],
       [ 3. ,  3. , 41. ],
       [ 1. ,  1. , 10. ]])

In [14]:
produce.iloc[[1,2,3], :]

           price  discount_price  inventory
banana         2             2.0       50.0
jackfruit      5             4.5        NaN
mango          3             3.0       41.0

In [15]:
produce['discount_price']

apple        1.0
banana       2.0
jackfruit    4.5
mango        3.0
pear         1.0
Name: discount_price, dtype: float64

In [16]:
produce.discount_price    # Avoid this style

apple        1.0
banana       2.0
jackfruit    4.5
mango        3.0
pear         1.0
Name: discount_price, dtype: float64

In [17]:
produce.loc[:, produce.max() > 5]

           inventory
apple           22.0
banana          50.0
jackfruit        NaN
mango           41.0
pear            10.0

In [18]:
produce.loc[produce['price'] == 1, :]

       price  discount_price  inventory
apple      1             1.0       22.0
pear       1             1.0       10.0

In [19]:
produce['inventory_value'] = produce['inventory'] * produce['price']

In [20]:
produce

           price  discount_price  inventory  inventory_value
apple          1             1.0       22.0             22.0
banana         2             2.0       50.0            100.0
jackfruit      5             4.5        NaN              NaN
mango          3             3.0       41.0            123.0
pear           1             1.0       10.0             10.0

In [21]:
produce.drop('inventory_value', axis = 1)

           price  discount_price  inventory
apple          1             1.0       22.0
banana         2             2.0       50.0
jackfruit      5             4.5        NaN
mango          3             3.0       41.0
pear           1             1.0       10.0

In [22]:
produce

           price  discount_price  inventory  inventory_value
apple          1             1.0       22.0             22.0
banana         2             2.0       50.0            100.0
jackfruit      5             4.5        NaN              NaN
mango          3             3.0       41.0            123.0
pear           1             1.0       10.0             10.0

In [23]:
produce.drop('inventory_value', axis = 1, inplace = True)

In [24]:
produce

           price  discount_price  inventory
apple          1             1.0       22.0
banana         2             2.0       50.0
jackfruit      5             4.5        NaN
mango          3             3.0       41.0
pear           1             1.0       10.0

In [25]:
produce.loc[produce.price >=3, 'price'] = 2.50

In [26]:
produce

           price  discount_price  inventory
apple        1.0             1.0       22.0
banana       2.0             2.0       50.0
jackfruit    2.5             4.5        NaN
mango        2.5             3.0       41.0
pear         1.0             1.0       10.0

In [27]:
import pandas as pd

prices = pd.Series([1,1,2,3,5],
              index=['apple', 'pear', 'banana', 'mango', 'jackfruit'])

inventory = pd.Series([10, 50, 41, 22],
              index=['pear', 'banana', 'mango', 'apple'])

discount_prices = prices.apply(lambda x: .9*x if x>3 else x)

produce = pd.DataFrame({'price':prices,
                        'discount_price':discount_prices,
                        'inventory':inventory})

In [28]:
one_select = produce.loc[['pear', 'jackfruit'], : ]
one_select

           price  discount_price  inventory
pear           1             1.0       10.0
jackfruit      5             4.5        NaN

In [29]:
produce['clearance_price'] = prices.apply(lambda x: .5 * x)
produce

           price  discount_price  inventory  clearance_price
apple          1             1.0       22.0              0.5
banana         2             2.0       50.0              1.0
jackfruit      5             4.5        NaN              2.5
mango          3             3.0       41.0              1.5
pear           1             1.0       10.0              0.5

In [30]:
two_clearance = produce.iloc[3, : ]
two_clearance

price               3.0
discount_price      3.0
inventory          41.0
clearance_price     1.5
Name: mango, dtype: float64

In [31]:
one_select = produce.loc[['pear', 'jackfruit']]
one_select

           price  discount_price  inventory  clearance_price
pear           1             1.0       10.0              0.5
jackfruit      5             4.5        NaN              2.5

In [32]:
produce['clearance_price'] = prices * 0.5
produce

           price  discount_price  inventory  clearance_price
apple          1             1.0       22.0              0.5
banana         2             2.0       50.0              1.0
jackfruit      5             4.5        NaN              2.5
mango          3             3.0       41.0              1.5
pear           1             1.0       10.0              0.5

In [33]:
two_clearance = produce.iloc[3]
two_clearance

price               3.0
discount_price      3.0
inventory          41.0
clearance_price     1.5
Name: mango, dtype: float64

In [34]:
produce['discount_percentage'] = (1 - produce['discount_price'] / produce['price']) * 100

In [35]:
produce

,price,discount_price,inventory,clearance_price,discount_percentage
apple,1,1.0,22.0,0.5,0.0
banana,2,2.0,50.0,1.0,0.0
jackfruit,5,4.5,NaN,2.5,10.0
mango,3,3.0,41.0,1.5,0.0
pear,1,1.0,10.0,0.5,0.0